bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA192D3.xml
        <module name="NVM" id="I6076" version="XMEGAD" caption="Non Volatile Memory Controller">
            <register-group caption="Non-volatile Memory Controller" name="NVM" size="17">
                <register caption="Address Register 0" name="ADDR0" offset="0x00" size="1"/>
                <register caption="Address Register 1" name="ADDR1" offset="0x01" size="1"/>
                <register caption="Address Register 2" name="ADDR2" offset="0x02" size="1"/>
                <register caption="Data Register 0" name="DATA0" offset="0x04" size="1"/>
                <register caption="Data Register 1" name="DATA1" offset="0x05" size="1"/>
                <register caption="Data Register 2" name="DATA2" offset="0x06" size="1"/>
                <register caption="Command" name="CMD" offset="0x0A" size="1">
                    <bitfield caption="Command" mask="0x7F" name="CMD" values="NVM_CMD"/>
                </register>
                <register caption="Control Register A" name="CTRLA" offset="0x0B" size="1">
                    <bitfield caption="Command Execute" mask="0x01" name="CMDEX"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x0C" size="1">
                    <bitfield caption="EEPROM Mapping Enable" mask="0x08" name="EEMAPEN"/>
                    <bitfield caption="Flash Power Reduction Enable" mask="0x04" name="FPRM"/>
                    <bitfield caption="EEPROM Power Reduction Enable" mask="0x02" name="EPRM"/>
                    <bitfield caption="SPM Lock" mask="0x01" name="SPMLOCK"/>
                </register>
                <register caption="Interrupt Control" name="INTCTRL" offset="0x0D" size="1">
                    <bitfield caption="SPM Interrupt Level" mask="0x0C" name="SPMLVL" values="NVM_SPMLVL"/>
                    <bitfield caption="EEPROM Interrupt Level" mask="0x03" name="EELVL" values="NVM_EELVL"/>
                </register>
                <register caption="Status" name="STATUS" offset="0x0F" size="1">
                    <bitfield caption="Non-volatile Memory Busy" mask="0x80" name="NVMBUSY"/>
                    <bitfield caption="Flash Memory Busy" mask="0x40" name="FBUSY"/>
                    <bitfield caption="EEPROM Page Buffer Active Loading" mask="0x02" name="EELOAD"/>
                    <bitfield caption="Flash Page Buffer Active Loading" mask="0x01" name="FLOAD"/>
                </register>
                <register caption="Lock Bits" name="LOCKBITS" offset="0x10" size="1">
                    <bitfield caption="Boot Lock Bits - Boot Section" mask="0xC0" name="BLBB" values="NVM_BLBB"/>
                    <bitfield caption="Boot Lock Bits - Application Section" mask="0x30" name="BLBA" values="NVM_BLBA"/>
                    <bitfield caption="Boot Lock Bits - Application Table" mask="0x0C" name="BLBAT" values="NVM_BLBAT"/>
                    <bitfield caption="Lock Bits" mask="0x03" name="LB" values="NVM_LB"/>
                </register>
            </register-group>
            <register-group caption="Lock Bits" name="NVM_LOCKBITS" size="1">
                <register caption="Lock Bits" name="LOCKBITS" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Boot Lock Bits - Boot Section" mask="0xC0" name="BLBB" values="NVM_BLBB"/>
                    <bitfield caption="Boot Lock Bits - Application Section" mask="0x30" name="BLBA" values="NVM_BLBA"/>
                    <bitfield caption="Boot Lock Bits - Application Table" mask="0x0C" name="BLBAT" values="NVM_BLBAT"/>
                    <bitfield caption="Lock Bits" mask="0x03" name="LB" values="NVM_LB"/>
                </register>
            </register-group>
            <register-group caption="Fuses" name="NVM_FUSES" size="6">
                <register caption="Watchdog Configuration" name="FUSEBYTE1" offset="0x01" size="1" initval="0x00">
                    <bitfield caption="Watchdog Window Timeout Period" mask="0xF0" name="WDWPER" values="WDWPER"/>
                    <bitfield caption="Watchdog Timeout Period" mask="0x0F" name="WDPER" values="WDPER"/>
                </register>
                <register caption="Reset Configuration" name="FUSEBYTE2" offset="0x02" size="1" initval="0xFF">
                    <bitfield caption="Boot Loader Section Reset Vector" mask="0x40" name="BOOTRST" values="BOOTRST"/>
                    <bitfield caption="Timer Oscillator pin location" mask="0x20" name="TOSCSEL" values="TOSCSEL"/>
                    <bitfield caption="BOD Operation in Power-Down Mode" mask="0x03" name="BODPD" values="BODPD"/>
                </register>
                <register caption="Start-up Configuration" name="FUSEBYTE4" offset="0x04" size="1" initval="0xFF">
                    <bitfield caption="External Reset Disable" mask="0x10" name="RSTDISBL"/>
                    <bitfield caption="Start-up Time" mask="0x0C" name="STARTUPTIME" values="SUT"/>
                    <bitfield caption="Watchdog Timer Lock" mask="0x02" name="WDLOCK"/>
                </register>
                <register caption="EESAVE and BOD Level" name="FUSEBYTE5" offset="0x05" size="1" initval="0xFF">
                    <bitfield caption="BOD Operation in Active Mode" mask="0x30" name="BODACT" values="BODACT"/>
                    <bitfield caption="Preserve EEPROM Through Chip Erase" mask="0x08" name="EESAVE"/>
                    <bitfield caption="Brownout Detection Voltage Level" mask="0x07" name="BODLEVEL" values="BODLVL"/>
                </register>
            </register-group>
            <register-group caption="Production Signatures" name="NVM_PROD_SIGNATURES" size="63">
                <register caption="RCOSC 2MHz Calibration Value B" name="RCOSC2M" offset="0x00" size="1"/>
                <register caption="RCOSC 2MHz Calibration Value A" name="RCOSC2MA" offset="0x01" size="1"/>
                <register caption="RCOSC 32kHz Calibration Value" name="RCOSC32K" offset="0x02" size="1"/>
                <register caption="RCOSC 32MHz Calibration Value B" name="RCOSC32M" offset="0x03" size="1"/>
