bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA192D3.xml
                <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
                    <bitfield caption="Low Byte Compare D Interrupt Flag" mask="0x80" name="LCMPDIF"/>
                    <bitfield caption="Low Byte Compare C Interrupt Flag" mask="0x40" name="LCMPCIF"/>
                    <bitfield caption="Low Byte Compare B Interrupt Flag" mask="0x20" name="LCMPBIF"/>
                    <bitfield caption="Low Byte Compare A Interrupt Flag" mask="0x10" name="LCMPAIF"/>
                    <bitfield caption="High Byte Underflow Interrupt Flag" mask="0x02" name="HUNFIF"/>
                    <bitfield caption="Low Byte Underflow Interrupt Flag" mask="0x01" name="LUNFIF"/>
                </register>
                <register caption="Low Byte Count" name="LCNT" offset="0x20" size="1"/>
                <register caption="High Byte Count" name="HCNT" offset="0x21" size="1"/>
                <register caption="Low Byte Period" name="LPER" offset="0x26" size="1"/>
                <register caption="High Byte Period" name="HPER" offset="0x27" size="1"/>
                <register caption="Low Byte Compare A" name="LCMPA" offset="0x28" size="1"/>
                <register caption="High Byte Compare A" name="HCMPA" offset="0x29" size="1"/>
                <register caption="Low Byte Compare B" name="LCMPB" offset="0x2A" size="1"/>
                <register caption="High Byte Compare B" name="HCMPB" offset="0x2B" size="1"/>
                <register caption="Low Byte Compare C" name="LCMPC" offset="0x2C" size="1"/>
                <register caption="High Byte Compare C" name="HCMPC" offset="0x2D" size="1"/>
                <register caption="Low Byte Compare D" name="LCMPD" offset="0x2E" size="1"/>
                <register caption="High Byte Compare D" name="HCMPD" offset="0x2F" size="1"/>
            </register-group>
            <value-group caption="Clock Selection" name="TC2_CLKSEL">
                <value caption="Timer Off" name="OFF" value="0x00"/>
                <value caption="System Clock" name="DIV1" value="0x01"/>
                <value caption="System Clock / 2" name="DIV2" value="0x02"/>
                <value caption="System Clock / 4" name="DIV4" value="0x03"/>
                <value caption="System Clock / 8" name="DIV8" value="0x04"/>
                <value caption="System Clock / 64" name="DIV64" value="0x05"/>
                <value caption="System Clock / 256" name="DIV256" value="0x06"/>
                <value caption="System Clock / 1024" name="DIV1024" value="0x07"/>
                <value caption="Event Channel 0" name="EVCH0" value="0x08"/>
                <value caption="Event Channel 1" name="EVCH1" value="0x09"/>
                <value caption="Event Channel 2" name="EVCH2" value="0x0A"/>
                <value caption="Event Channel 3" name="EVCH3" value="0x0B"/>
            </value-group>
            <value-group caption="Byte Mode" name="TC2_BYTEM">
                <value caption="16-bit mode" name="NORMAL" value="0x00"/>
                <value caption="Timer/Counter operating in byte mode only (TC2)" name="BYTEMODE" value="0x01"/>
                <value caption="Timer/Counter split into two 8-bit Counters" name="SPLITMODE" value="0x02"/>
            </value-group>
            <value-group caption="High Byte Underflow Interrupt Level" name="TC2_HUNFINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Low Byte Underflow Interrupt Level" name="TC2_LUNFINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Low Byte Compare D Interrupt Level" name="TC2_LCMPDINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Low Byte Compare C Interrupt Level" name="TC2_LCMPCINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Low Byte Compare B Interrupt Level" name="TC2_LCMPBINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Low Byte Compare A Interrupt Level" name="TC2_LCMPAINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Timer/Counter Command" name="TC2_CMD">
                <value caption="No Command" name="NONE" value="0x00"/>
                <value caption="Force Restart" name="RESTART" value="0x02"/>
                <value caption="Force Hard Reset" name="RESET" value="0x03"/>
            </value-group>
            <value-group caption="Timer/Counter Command" name="TC2_CMDEN">
                <value caption="Low Byte Timer/Counter" name="LOW" value="0x01"/>
                <value caption="High Byte Timer/Counter" name="HIGH" value="0x02"/>
                <value caption="Both Low Byte and High Byte Timer/Counters" name="BOTH" value="0x03"/>
            </value-group>
            <interrupt-group name="TC2">
                <interrupt index="0" name="LUNF" caption="Low Byte Underflow Interrupt"/>
                <interrupt index="1" name="HUNF" caption="High Byte Underflow Interrupt"/>
                <interrupt index="2" name="LCMPA" caption="Low Byte Compare A Interrupt"/>
                <interrupt index="3" name="LCMPB" caption="Low Byte Compare B Interrupt"/>
                <interrupt index="4" name="LCMPC" caption="Low Byte Compare C Interrupt"/>
                <interrupt index="5" name="LCMPD" caption="Low Byte Compare D Interrupt"/>
            </interrupt-group>
        </module>
        <module name="USART" id="I6090" caption="Universal Asynchronous Receiver-Transmitter">
            <register-group caption="Universal Synchronous/Asynchronous Receiver/Transmitter" name="USART" size="8">
                <register caption="Data Register" name="DATA" offset="0x00" size="1"/>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Receive Interrupt Flag" mask="0x80" name="RXCIF"/>
                    <bitfield caption="Transmit Interrupt Flag" mask="0x40" name="TXCIF"/>
                    <bitfield caption="Data Register Empty Flag" mask="0x20" name="DREIF"/>
                    <bitfield caption="Frame Error" mask="0x10" name="FERR"/>
                    <bitfield caption="Buffer Overflow" mask="0x08" name="BUFOVF"/>
                    <bitfield caption="Parity Error" mask="0x04" name="PERR"/>
                    <bitfield caption="Receive Bit 8" mask="0x01" name="RXB8"/>
                </register>
                <register caption="Control Register A" name="CTRLA" offset="0x03" size="1">
                    <bitfield caption="Receive Interrupt Level" mask="0x30" name="RXCINTLVL" values="USART_RXCINTLVL"/>
                    <bitfield caption="Transmit Interrupt Level" mask="0x0C" name="TXCINTLVL" values="USART_TXCINTLVL"/>
                    <bitfield caption="Data Register Empty Interrupt Level" mask="0x03" name="DREINTLVL"
                              values="USART_DREINTLVL"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x04" size="1">
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
                    <bitfield caption="Double transmission speed" mask="0x04" name="CLK2X"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x02" name="MPCM"/>
                    <bitfield caption="Transmit bit 8" mask="0x01" name="TXB8"/>
                </register>
                <register caption="Control Register C" name="CTRLC" offset="0x05" size="1">
                    <bitfield caption="Communication Mode" mask="0xC0" name="CMODE" values="USART_CMODE"/>
                    <bitfield caption="Parity Mode" mask="0x30" name="PMODE" values="USART_PMODE"/>
                    <bitfield caption="Stop Bit Mode" mask="0x08" name="SBMODE"/>
                    <bitfield caption="Character Size" mask="0x07" name="CHSIZE" values="USART_CHSIZE"/>
                    <bitfield caption="SPI Master Mode, Data Order" mask="0x04" name="UDORD"/>
                    <bitfield caption="SPI Master Mode, Clock Phase" mask="0x02" name="UCPHA"/>
                </register>
                <register caption="Baud Rate Control Register A" name="BAUDCTRLA" offset="0x06" size="1">
                    <bitfield caption="Baud Rate Selection Bits [7:0]" mask="0xFF" name="BSEL"/>
                </register>
                <register caption="Baud Rate Control Register B" name="BAUDCTRLB" offset="0x07" size="1">
                    <bitfield caption="Baud Rate Scale" mask="0xF0" name="BSCALE"/>
                    <bitfield caption="Baud Rate Selection bits[11:8]" mask="0x0F" name="BSEL"/>
                </register>
            </register-group>
            <value-group caption="Receive Complete Interrupt level" name="USART_RXCINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Transmit Complete Interrupt level" name="USART_TXCINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Data Register Empty Interrupt level" name="USART_DREINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Character Size" name="USART_CHSIZE">
                <value caption="Character size: 5 bit" name="5BIT" value="0x00"/>
                <value caption="Character size: 6 bit" name="6BIT" value="0x01"/>
                <value caption="Character size: 7 bit" name="7BIT" value="0x02"/>
                <value caption="Character size: 8 bit" name="8BIT" value="0x03"/>
                <value caption="Character size: 9 bit" name="9BIT" value="0x07"/>
            </value-group>
            <value-group caption="Communication Mode" name="USART_CMODE">
                <value caption="Asynchronous Mode" name="ASYNCHRONOUS" value="0x00"/>
                <value caption="Synchronous Mode" name="SYNCHRONOUS" value="0x01"/>
                <value caption="IrDA Mode" name="IRDA" value="0x02"/>
                <value caption="Master SPI Mode" name="MSPI" value="0x03"/>
            </value-group>
            <value-group caption="Parity Mode" name="USART_PMODE">
                <value caption="No Parity" name="DISABLED" value="0x00"/>
                <value caption="Even Parity" name="EVEN" value="0x02"/>
                <value caption="Odd Parity" name="ODD" value="0x03"/>
            </value-group>
            <interrupt-group name="USART">
                <interrupt index="0" name="RXC" caption="Reception Complete Interrupt"/>
                <interrupt index="1" name="DRE" caption="Data Register Empty Interrupt"/>
                <interrupt index="2" name="TXC" caption="Transmission Complete Interrupt"/>
            </interrupt-group>
        </module>
        <module name="SPI" id="I6090" caption="Serial Peripheral Interface">
            <register-group caption="Serial Peripheral Interface" name="SPI" size="4">
                <register caption="Control Register" name="CTRL" offset="0x0" size="1">
                    <bitfield caption="Enable Double Speed" mask="0x80" name="CLK2X"/>
                    <bitfield caption="Enable Module" mask="0x40" name="ENABLE"/>
                    <bitfield caption="Data Order Setting" mask="0x20" name="DORD"/>
                    <bitfield caption="Master Operation Enable" mask="0x10" name="MASTER"/>
                    <bitfield caption="SPI Mode" mask="0x0C" name="MODE" values="SPI_MODE"/>
                    <bitfield caption="Prescaler" mask="0x03" name="PRESCALER" values="SPI_PRESCALER"/>
                </register>
                <register caption="Interrupt Control Register" name="INTCTRL" offset="0x01" size="1">
                    <bitfield caption="Interrupt level" mask="0x03" name="INTLVL" values="SPI_INTLVL"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x02" size="1">
                    <bitfield caption="Interrupt Flag" mask="0x80" name="IF"/>
                    <bitfield caption="Write Collision" mask="0x40" name="WRCOL"/>
                </register>
                <register caption="Data Register" name="DATA" offset="0x03" size="1"/>
            </register-group>
